# Spark DataFrame
Spark에서 DataFrame을 불러오고 활용한다.
SQL을 활용하여 실제 SQL를 사용하듯 코드를 작성하고 결과를 낼 수 있다.

### Point
- printSchema()를 활용해 칼럼별 데이터의 형식을 확인하며 코드를 작성하면 편리하다.
- show()를 통해 head()처럼 데이터의 대략적인 구조를 확인할 수 있다.
- filter()를 활용해 조건식을 작성 가능하다. where 절과 같은 기능
- 현업에서 사용하는 빈도는 적을 수 있지만 배우고 알고 있다는 것에 의미를 둘 수 있다.

In [1]:
from pyspark import SparkConf, SparkContext
from pyspark.sql import SQLContext

In [2]:
conf  = SparkConf().setMaster('local').setAppName('sparkApp')
spark = SparkContext(conf=conf)
spark

In [3]:
sqlCtx = SQLContext(spark)
sqlCtx

- csv 파일을 이용한 DataFrame 만들기
- 저번 시간에는 json 파일을 DataFrame으로 로드

In [16]:
orders = sqlCtx.read.csv('./data/orders.csv', 
                         header=True, 
                         inferSchema=True)
orders

DataFrame[OrderID: int, CustomerID: int, EmployeeID: int, OrderDate: string, ShipperID: double]

In [31]:
orders.printSchema()

root
 |-- OrderID: integer (nullable = true)
 |-- CustomerID: integer (nullable = true)
 |-- EmployeeID: integer (nullable = true)
 |-- OrderDate: string (nullable = true)
 |-- ShipperID: double (nullable = true)

In [18]:
print(orders.columns)
print(type(orders.columns))

['OrderID', 'CustomerID', 'EmployeeID', 'OrderDate', 'ShipperID']
<class 'list'>

In [19]:
orders.describe().show()

+-------+-----------------+------------------+------------------+---------+------------------+
|summary|          OrderID|        CustomerID|        EmployeeID|OrderDate|         ShipperID|
+-------+-----------------+------------------+------------------+---------+------------------+
|  count|              196|               196|               196|      196|               196|
|   mean|          10345.5| 48.64795918367347|4.3520408163265305|     null|2.0714285714285716|
| stddev|56.72448031200168|25.621776513566466|  2.41651283366105|     null|0.7877263614433762|
|    min|            10248|                 2|                 1| 1/1/1997|               1.0|
|    max|            10443|                91|                 9| 9/9/1996|               3.0|
+-------+-----------------+------------------+------------------+---------+------------------+

In [20]:
orders.summary().show()

+-------+-----------------+------------------+------------------+---------+------------------+
|summary|          OrderID|        CustomerID|        EmployeeID|OrderDate|         ShipperID|
+-------+-----------------+------------------+------------------+---------+------------------+
|  count|              196|               196|               196|      196|               196|
|   mean|          10345.5| 48.64795918367347|4.3520408163265305|     null|2.0714285714285716|
| stddev|56.72448031200168|25.621776513566466|  2.41651283366105|     null|0.7877263614433762|
|    min|            10248|                 2|                 1| 1/1/1997|               1.0|
|    25%|            10296|                25|                 2|     null|               1.0|
|    50%|            10345|                51|                 4|     null|               2.0|
|    75%|            10394|                69|                 6|     null|               3.0|
|    max|            10443|                91|                 9| 9/9/1996|               3.0|
+-------+-----------------+------------------+------------------+---------+------------------+

In [22]:
orders.first()

Row(OrderID=10248, CustomerID=90, EmployeeID=5, OrderDate='7/4/1996', ShipperID=3.0)

In [23]:
# 검색 select()
orders.select(['OrderID', 'CustomerID']).show()

+-------+----------+
|OrderID|CustomerID|
+-------+----------+
|  10248|        90|
|  10249|        81|
|  10250|        34|
|  10251|        84|
|  10252|        76|
|  10253|        34|
|  10254|        14|
|  10255|        68|
|  10256|        88|
|  10257|        35|
|  10258|        20|
|  10259|        13|
|  10260|        55|
|  10261|        61|
|  10262|        65|
|  10263|        20|
|  10264|        24|
|  10265|         7|
|  10266|        87|
|  10267|        25|
+-------+----------+
only showing top 20 rows

In [24]:
# withColumn()
# orders.show()
orders.withColumn('newOrderID', orders['OrderID']*2).show()

+-------+----------+----------+---------+---------+----------+
|OrderID|CustomerID|EmployeeID|OrderDate|ShipperID|newOrderID|
+-------+----------+----------+---------+---------+----------+
|  10248|        90|         5| 7/4/1996|      3.0|     20496|
|  10249|        81|         6| 7/5/1996|      1.0|     20498|
|  10250|        34|         4| 7/8/1996|      2.0|     20500|
|  10251|        84|         3| 7/8/1996|      1.0|     20502|
|  10252|        76|         4| 7/9/1996|      2.0|     20504|
|  10253|        34|         3|7/10/1996|      2.0|     20506|
|  10254|        14|         5|7/11/1996|      2.0|     20508|
|  10255|        68|         9|7/12/1996|      3.0|     20510|
|  10256|        88|         3|7/15/1996|      2.0|     20512|
|  10257|        35|         4|7/16/1996|      3.0|     20514|
|  10258|        20|         1|7/17/1996|      1.0|     20516|
|  10259|        13|         4|7/18/1996|      3.0|     20518|
|  10260|        55|         4|7/19/1996|      1.0|     20520|
|  10261|        61|         4|7/19/1996|      2.0|     20522|
|  10262|        65|         8|7/22/1996|      3.0|     20524|
|  10263|        20|         9|7/23/1996|      3.0|     20526|
|  10264|        24|         6|7/24/1996|      3.0|     20528|
|  10265|         7|         2|7/25/1996|      1.0|     20530|
|  10266|        87|         3|7/26/1996|      3.0|     20532|
|  10267|        25|         4|7/29/1996|      1.0|     20534|
+-------+----------+----------+---------+---------+----------+
only showing top 20 rows

In [28]:
orders.withColumnRenamed('OrderID','renameOrderID').show()

+-------------+----------+----------+---------+---------+
|renameOrderID|CustomerID|EmployeeID|OrderDate|ShipperID|
+-------------+----------+----------+---------+---------+
|        10248|        90|         5| 7/4/1996|      3.0|
|        10249|        81|         6| 7/5/1996|      1.0|
|        10250|        34|         4| 7/8/1996|      2.0|
|        10251|        84|         3| 7/8/1996|      1.0|
|        10252|        76|         4| 7/9/1996|      2.0|
|        10253|        34|         3|7/10/1996|      2.0|
|        10254|        14|         5|7/11/1996|      2.0|
|        10255|        68|         9|7/12/1996|      3.0|
|        10256|        88|         3|7/15/1996|      2.0|
|        10257|        35|         4|7/16/1996|      3.0|
|        10258|        20|         1|7/17/1996|      1.0|
|        10259|        13|         4|7/18/1996|      3.0|
|        10260|        55|         4|7/19/1996|      1.0|
|        10261|        61|         4|7/19/1996|      2.0|
|        10262|        65|         8|7/22/1996|      3.0|
|        10263|        20|         9|7/23/1996|      3.0|
|        10264|        24|         6|7/24/1996|      3.0|
|        10265|         7|         2|7/25/1996|      1.0|
|        10266|        87|         3|7/26/1996|      3.0|
|        10267|        25|         4|7/29/1996|      1.0|
+-------------+----------+----------+---------+---------+
only showing top 20 rows

In [29]:
orders.show()

+-------+----------+----------+---------+---------+
|OrderID|CustomerID|EmployeeID|OrderDate|ShipperID|
+-------+----------+----------+---------+---------+
|  10248|        90|         5| 7/4/1996|      3.0|
|  10249|        81|         6| 7/5/1996|      1.0|
|  10250|        34|         4| 7/8/1996|      2.0|
|  10251|        84|         3| 7/8/1996|      1.0|
|  10252|        76|         4| 7/9/1996|      2.0|
|  10253|        34|         3|7/10/1996|      2.0|
|  10254|        14|         5|7/11/1996|      2.0|
|  10255|        68|         9|7/12/1996|      3.0|
|  10256|        88|         3|7/15/1996|      2.0|
|  10257|        35|         4|7/16/1996|      3.0|
|  10258|        20|         1|7/17/1996|      1.0|
|  10259|        13|         4|7/18/1996|      3.0|
|  10260|        55|         4|7/19/1996|      1.0|
|  10261|        61|         4|7/19/1996|      2.0|
|  10262|        65|         8|7/22/1996|      3.0|
|  10263|        20|         9|7/23/1996|      3.0|
|  10264|        24|         6|7/24/1996|      3.0|
|  10265|         7|         2|7/25/1996|      1.0|
|  10266|        87|         3|7/26/1996|      3.0|
|  10267|        25|         4|7/29/1996|      1.0|
+-------+----------+----------+---------+---------+
only showing top 20 rows

In [30]:
# groupby() - 집계 함수
orders.groupBy('EmployeeID').count().show()

+----------+-----+
|EmployeeID|count|
+----------+-----+
|         1|   29|
|         6|   18|
|         3|   31|
|         5|   11|
|         9|    6|
|         4|   40|
|         8|   27|
|         7|   14|
|         2|   20|
+----------+-----+

## Cospi 데이터 다루기

In [35]:
orders = sqlCtx.read.csv('./data/cospi.csv', 
                         header=True, 
                         inferSchema=True)

In [49]:
orders.printSchema()

root
 |-- Date: timestamp (nullable = true)
 |-- Open: integer (nullable = true)
 |-- High: integer (nullable = true)
 |-- Low: integer (nullable = true)
 |-- Close: integer (nullable = true)
 |-- Volume: integer (nullable = true)

In [50]:
orders.show()

+-------------------+-------+-------+-------+-------+------+
|               Date|   Open|   High|    Low|  Close|Volume|
+-------------------+-------+-------+-------+-------+------+
|2016-02-26 00:00:00|1180000|1187000|1172000|1172000|176906|
|2016-02-25 00:00:00|1172000|1187000|1172000|1179000|128321|
|2016-02-24 00:00:00|1178000|1179000|1161000|1172000|140407|
|2016-02-23 00:00:00|1179000|1189000|1173000|1181000|147578|
|2016-02-22 00:00:00|1190000|1192000|1166000|1175000|174075|
|2016-02-19 00:00:00|1187000|1195000|1174000|1190000|175889|
|2016-02-18 00:00:00|1203000|1203000|1178000|1187000|211795|
|2016-02-17 00:00:00|1179000|1201000|1169000|1185000|245929|
|2016-02-16 00:00:00|1158000|1179000|1157000|1168000|179087|
|2016-02-15 00:00:00|1154000|1160000|1144000|1154000|182471|
|2016-02-12 00:00:00|1130000|1151000|1122000|1130000|254115|
|2016-02-11 00:00:00|1118000|1137000|1118000|1130000|304899|
|2016-02-05 00:00:00|1156000|1169000|1156000|1164000|183280|
|2016-02-04 00:00:00|1150000|1161000|1148000|1156000|236429|
|2016-02-03 00:00:00|1150000|1152000|1137000|1146000|174381|
|2016-02-02 00:00:00|1161000|1166000|1147000|1156000|165420|
|2016-02-01 00:00:00|1152000|1163000|1151000|1163000|258194|
|2016-01-29 00:00:00|1140000|1150000|1116000|1150000|426238|
|2016-01-28 00:00:00|1164000|1168000|1139000|1145000|314154|
|2016-01-27 00:00:00|1126000|1175000|1126000|1175000|273707|
+-------------------+-------+-------+-------+-------+------+
only showing top 20 rows

### filter(조건식)
- where 조건절과 같은 느낌
- Schema()에서 확인할 수 있는 해당 칼럼의 데이터타입을 확인하고 조건식을 부여

In [36]:
# Date가 2월인 데이터만 필터링
orders.filter(orders['Date'] >= '2016-02-01').show()

+-------------------+-------+-------+-------+-------+------+
|               Date|   Open|   High|    Low|  Close|Volume|
+-------------------+-------+-------+-------+-------+------+
|2016-02-26 00:00:00|1180000|1187000|1172000|1172000|176906|
|2016-02-25 00:00:00|1172000|1187000|1172000|1179000|128321|
|2016-02-24 00:00:00|1178000|1179000|1161000|1172000|140407|
|2016-02-23 00:00:00|1179000|1189000|1173000|1181000|147578|
|2016-02-22 00:00:00|1190000|1192000|1166000|1175000|174075|
|2016-02-19 00:00:00|1187000|1195000|1174000|1190000|175889|
|2016-02-18 00:00:00|1203000|1203000|1178000|1187000|211795|
|2016-02-17 00:00:00|1179000|1201000|1169000|1185000|245929|
|2016-02-16 00:00:00|1158000|1179000|1157000|1168000|179087|
|2016-02-15 00:00:00|1154000|1160000|1144000|1154000|182471|
|2016-02-12 00:00:00|1130000|1151000|1122000|1130000|254115|
|2016-02-11 00:00:00|1118000|1137000|1118000|1130000|304899|
|2016-02-05 00:00:00|1156000|1169000|1156000|1164000|183280|
|2016-02-04 00:00:00|1150000|1161000|1148000|1156000|236429|
|2016-02-03 00:00:00|1150000|1152000|1137000|1146000|174381|
|2016-02-02 00:00:00|1161000|1166000|1147000|1156000|165420|
|2016-02-01 00:00:00|1152000|1163000|1151000|1163000|258194|
+-------------------+-------+-------+-------+-------+------+

In [37]:
# 종가가 1200000 이상인 데이터만 필터링하기
# select로 원하는 칼럼만 가져오는 것도 가능
orders.filter(orders['Close'] > 1200000).select(['Date', 'Open', 'Close']).show()

+-------------------+-------+-------+
|               Date|   Open|  Close|
+-------------------+-------+-------+
|2016-01-05 00:00:00|1202000|1208000|
|2016-01-04 00:00:00|1260000|1205000|
|2015-12-30 00:00:00|1260000|1260000|
|2015-12-29 00:00:00|1265000|1254000|
|2015-12-28 00:00:00|1285000|1266000|
|2015-12-24 00:00:00|1295000|1285000|
|2015-12-23 00:00:00|1292000|1295000|
|2015-12-22 00:00:00|1280000|1292000|
|2015-12-21 00:00:00|1278000|1280000|
|2015-12-18 00:00:00|1265000|1278000|
|2015-12-17 00:00:00|1301000|1290000|
|2015-12-16 00:00:00|1278000|1299000|
|2015-12-15 00:00:00|1261000|1277000|
|2015-12-14 00:00:00|1273000|1261000|
|2015-12-11 00:00:00|1283000|1284000|
|2015-12-10 00:00:00|1263000|1283000|
|2015-12-09 00:00:00|1262000|1263000|
|2015-12-08 00:00:00|1262000|1262000|
|2015-12-07 00:00:00|1269000|1262000|
|2015-12-04 00:00:00|1275000|1269000|
+-------------------+-------+-------+
only showing top 20 rows

In [38]:
# Volume 300000 이하인 데이터만 필터링
orders.filter( (orders['Volume'] > 300000 )).show()

+-------------------+-------+-------+-------+-------+------+
|               Date|   Open|   High|    Low|  Close|Volume|
+-------------------+-------+-------+-------+-------+------+
|2016-02-11 00:00:00|1118000|1137000|1118000|1130000|304899|
|2016-01-29 00:00:00|1140000|1150000|1116000|1150000|426238|
|2016-01-28 00:00:00|1164000|1168000|1139000|1145000|314154|
|2016-01-18 00:00:00|1088000|1133000|1088000|1126000|320007|
|2016-01-06 00:00:00|1208000|1208000|1168000|1175000|359895|
|2016-01-04 00:00:00|1260000|1260000|1205000|1205000|304050|
|2015-12-10 00:00:00|1263000|1293000|1263000|1283000|302978|
|2015-11-30 00:00:00|1325000|1325000|1284000|1284000|515530|
|2015-11-02 00:00:00|1385000|1393000|1374000|1383000|365104|
|2015-10-30 00:00:00|1345000|1390000|1341000|1372000|498776|
|2015-10-29 00:00:00|1330000|1392000|1324000|1325000|622336|
|2015-10-12 00:00:00|1260000|1263000|1247000|1260000|301807|
|2015-10-08 00:00:00|1250000|1279000|1250000|1270000|500566|
|2015-10-07 00:00:00|1198000|1252000|1186000|1251000|795678|
|2015-10-06 00:00:00|1130000|1155000|1127000|1151000|371835|
|2015-09-30 00:00:00|1100000|1134000|1090000|1134000|354069|
|2015-09-18 00:00:00|1145000|1192000|1135000|1190000|421097|
|2015-09-16 00:00:00|1121000|1157000|1121000|1152000|338783|
|2015-09-10 00:00:00|1130000|1139000|1118000|1134000|356879|
|2015-09-03 00:00:00|1102000|1123000|1093000|1122000|303343|
+-------------------+-------+-------+-------+-------+------+
only showing top 20 rows

In [40]:
orders.filter(orders['Date'] == '2016-02-26').show()

+-------------------+-------+-------+-------+-------+------+
|               Date|   Open|   High|    Low|  Close|Volume|
+-------------------+-------+-------+-------+-------+------+
|2016-02-26 00:00:00|1180000|1187000|1172000|1172000|176906|
+-------------------+-------+-------+-------+-------+------+

## titanic_train.csv[실습]

In [41]:
titanic = sqlCtx.read.csv('./data/titanic_train.csv', 
                          header=True, 
                          inferSchema=True)
type(titanic)

pyspark.sql.dataframe.DataFrame

In [42]:
titanic.show()

+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|          1|       0|     3|Braund, Mr. Owen ...|  male|22.0|    1|    0|       A/5 21171|   7.25| null|       S|
|          2|       1|     1|Cumings, Mrs. Joh...|female|38.0|    1|    0|        PC 17599|71.2833|  C85|       C|
|          3|       1|     3|Heikkinen, Miss. ...|female|26.0|    0|    0|STON/O2. 3101282|  7.925| null|       S|
|          4|       1|     1|Futrelle, Mrs. Ja...|female|35.0|    1|    0|          113803|   53.1| C123|       S|
|          5|       0|     3|Allen, Mr. Willia...|  male|35.0|    0|    0|          373450|   8.05| null|       S|
|          6|       0|     3|    Moran, Mr. James|  male|null|    0|    0|          330877| 8.4583| null|       Q|
|          7|       0|     1|McCarthy, Mr. Tim...|  male|54.0|    0|    0|           17463|51.8625|  E46|       S|
|          8|       0|     3|Palsson, Master. ...|  male| 2.0|    3|    1|          349909| 21.075| null|       S|
|          9|       1|     3|Johnson, Mrs. Osc...|female|27.0|    0|    2|          347742|11.1333| null|       S|
|         10|       1|     2|Nasser, Mrs. Nich...|female|14.0|    1|    0|          237736|30.0708| null|       C|
|         11|       1|     3|Sandstrom, Miss. ...|female| 4.0|    1|    1|         PP 9549|   16.7|   G6|       S|
|         12|       1|     1|Bonnell, Miss. El...|female|58.0|    0|    0|          113783|  26.55| C103|       S|
|         13|       0|     3|Saundercock, Mr. ...|  male|20.0|    0|    0|       A/5. 2151|   8.05| null|       S|
|         14|       0|     3|Andersson, Mr. An...|  male|39.0|    1|    5|          347082| 31.275| null|       S|
|         15|       0|     3|Vestrom, Miss. Hu...|female|14.0|    0|    0|          350406| 7.8542| null|       S|
|         16|       1|     2|Hewlett, Mrs. (Ma...|female|55.0|    0|    0|          248706|   16.0| null|       S|
|         17|       0|     3|Rice, Master. Eugene|  male| 2.0|    4|    1|          382652| 29.125| null|       Q|
|         18|       1|     2|Williams, Mr. Cha...|  male|null|    0|    0|          244373|   13.0| null|       S|
|         19|       0|     3|Vander Planke, Mr...|female|31.0|    1|    0|          345763|   18.0| null|       S|
|         20|       1|     3|Masselmani, Mrs. ...|female|null|    0|    0|            2649|  7.225| null|       C|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
only showing top 20 rows

In [43]:
titanic.columns

['PassengerId',
 'Survived',
 'Pclass',
 'Name',
 'Sex',
 'Age',
 'SibSp',
 'Parch',
 'Ticket',
 'Fare',
 'Cabin',
 'Embarked']

In [44]:
titanic.count()

891

In [45]:
# select 변수 선택 ; PassengerId, Name
titanic.select(['PassengerId', 'Name']).show()

+-----------+--------------------+
|PassengerId|                Name|
+-----------+--------------------+
|          1|Braund, Mr. Owen ...|
|          2|Cumings, Mrs. Joh...|
|          3|Heikkinen, Miss. ...|
|          4|Futrelle, Mrs. Ja...|
|          5|Allen, Mr. Willia...|
|          6|    Moran, Mr. James|
|          7|McCarthy, Mr. Tim...|
|          8|Palsson, Master. ...|
|          9|Johnson, Mrs. Osc...|
|         10|Nasser, Mrs. Nich...|
|         11|Sandstrom, Miss. ...|
|         12|Bonnell, Miss. El...|
|         13|Saundercock, Mr. ...|
|         14|Andersson, Mr. An...|
|         15|Vestrom, Miss. Hu...|
|         16|Hewlett, Mrs. (Ma...|
|         17|Rice, Master. Eugene|
|         18|Williams, Mr. Cha...|
|         19|Vander Planke, Mr...|
|         20|Masselmani, Mrs. ...|
+-----------+--------------------+
only showing top 20 rows

In [48]:
# 생존자 여성의 PassengerId, Name, Sex, Survived 출력
titanic.filter((titanic.Sex == 'female') & (titanic.Survived == 1)).select(['PassengerId', 'Name' ,'Sex', 'Survived']).show()

+-----------+--------------------+------+--------+
|PassengerId|                Name|   Sex|Survived|
+-----------+--------------------+------+--------+
|          2|Cumings, Mrs. Joh...|female|       1|
|          3|Heikkinen, Miss. ...|female|       1|
|          4|Futrelle, Mrs. Ja...|female|       1|
|          9|Johnson, Mrs. Osc...|female|       1|
|         10|Nasser, Mrs. Nich...|female|       1|
|         11|Sandstrom, Miss. ...|female|       1|
|         12|Bonnell, Miss. El...|female|       1|
|         16|Hewlett, Mrs. (Ma...|female|       1|
|         20|Masselmani, Mrs. ...|female|       1|
|         23|"McGowan, Miss. A...|female|       1|
|         26|Asplund, Mrs. Car...|female|       1|
|         29|"O'Dwyer, Miss. E...|female|       1|
|         32|Spencer, Mrs. Wil...|female|       1|
|         33|Glynn, Miss. Mary...|female|       1|
|         40|Nicola-Yarred, Mi...|female|       1|
|         44|Laroche, Miss. Si...|female|       1|
|         45|Devaney, Miss. Ma...|female|       1|
|         48|O'Driscoll, Miss....|female|       1|
|         53|Harper, Mrs. Henr...|female|       1|
|         54|Faunthorpe, Mrs. ...|female|       1|
+-----------+--------------------+------+--------+
only showing top 20 rows

In [51]:
# 선실등급(Pclass) 별 요금 평균 확인하기
# class_grp = titanic.groupBy('Pclass')
# class_grp.avg('Fare').show()
# type(class_grp)

# 정렬 sort()
titanic.groupBy('Pclass').avg('Fare').sort('avg(Fare)'  , ascending=False).show()

+------+------------------+
|Pclass|         avg(Fare)|
+------+------------------+
|     1| 84.15468749999992|
|     2| 20.66218315217391|
|     3|13.675550101832997|
+------+------------------+

## Spark SQL

In [53]:
import pandas as pd

In [54]:
data1 = {'PassengerId':{0:1, 1:2, 2:3, 3:4, 4:5},
         'Name' : {0:'Owen', 1:'Florence', 2:'Laina', 3:'Lily', 4:"William"},
         'sex' : {0: 'male', 1: 'female', 2:'female', 3:'female', 4:'male'},
         'Survived': {0:0, 1:1, 2:1, 3:1, 4:0}
        }

data2 = {'PassengerId':{0:1, 1:2, 2:3, 3:4, 4:5},
         'Age' : {0: 22, 1: 38, 2: 33, 3: 35, 4: 35},
         'Fare' : {0: 7.3, 1: 71.3, 2:7.9, 3:53.1, 4:8.0},
         'Pclass': {0:3, 1:1, 2:3, 3:1, 4:3}
        }

In [56]:
display(data1.keys())
display(data2.keys())

dict_keys(['PassengerId', 'Name', 'sex', 'Survived'])

dict_keys(['PassengerId', 'Age', 'Fare', 'Pclass'])

### pandas df -> spark df

In [57]:
sample_df01 = pd.DataFrame(data1, columns=data1.keys())
sample_df02 = pd.DataFrame(data2, columns=data2.keys())
display(sample_df01)
display(sample_df02)
type(sample_df02)

   PassengerId      Name     sex  Survived
0            1      Owen    male         0
1            2  Florence  female         1
2            3     Laina  female         1
3            4      Lily  female         1
4            5   William    male         0

   PassengerId  Age  Fare  Pclass
0            1   22   7.3       3
1            2   38  71.3       1
2            3   33   7.9       3
3            4   35  53.1       1
4            5   35   8.0       3

pandas.core.frame.DataFrame

In [58]:
# pandas -> spark type의 DataFrame으로 만드는 방법

spark_df01 = sqlCtx.createDataFrame(sample_df01)
# type(spark_df01)

spark_df02 = sqlCtx.createDataFrame(sample_df02)
# type(spark_df02)

In [59]:
spark_df01.printSchema()

root
 |-- PassengerId: long (nullable = true)
 |-- Name: string (nullable = true)
 |-- sex: string (nullable = true)
 |-- Survived: long (nullable = true)

In [60]:
spark_df02.printSchema()

root
 |-- PassengerId: long (nullable = true)
 |-- Age: long (nullable = true)
 |-- Fare: double (nullable = true)
 |-- Pclass: long (nullable = true)

In [61]:
spark_df02.show()

+-----------+---+----+------+
|PassengerId|Age|Fare|Pclass|
+-----------+---+----+------+
|          1| 22| 7.3|     3|
|          2| 38|71.3|     1|
|          3| 33| 7.9|     3|
|          4| 35|53.1|     1|
|          5| 35| 8.0|     3|
+-----------+---+----+------+

In [62]:
# mirroring 
spark_df01.createOrReplaceTempView('titanic01')
spark_df02.createOrReplaceTempView('titanic02')

### Spark SQL SELECT

In [63]:
sqlCtx.sql("select * from titanic01 where sex='male'").show()

+-----------+-------+----+--------+
|PassengerId|   Name| sex|Survived|
+-----------+-------+----+--------+
|          1|   Owen|male|       0|
|          5|William|male|       0|
+-----------+-------+----+--------+

In [65]:
# 성별에 따른 생존자 수
sqlCtx.sql("""SELECT SEX, SUM(SURVIVED) AS CNT
              FROM   TITANIC01
              WHERE  SURVIVED = 1
              GROUP  BY SEX""").show()

+------+---+
|   SEX|CNT|
+------+---+
|female|  3|
+------+---+

In [66]:
# 선실 등급에 따른 평균 요금
sqlCtx.sql("""SELECT PCLASS ,  AVG(FARE)
              FROM   TITANIC01 T1
              JOIN   TITANIC02 T2 ON(T1.PASSENGERID = T2.PASSENGERID)
              GROUP  BY (PCLASS )""").show()

+------+-----------------+
|PCLASS|        avg(FARE)|
+------+-----------------+
|     1|             62.2|
|     3|7.733333333333334|
+------+-----------------+